src/test/resources/com/ingenico/direct/merchant/payments/rejected.json

{
    "errorId": "2c164323-20d3-4e9e-8578-dc562cd7506c-0000003c",
    "errors": [
        {
            "code": "21000020",
            "requestId": "2001798",
            "message": "VALUE **************** OF FIELD CREDITCARDNUMBER DID NOT PASS THE LUHNCHECK"
        }
    ],
    "paymentResult": {
        "creationOutput": {
            "additionalReference": "1",
            "externalReference": "1"
        },
        "payment": {
            "id": "1_0",
            "paymentOutput": {
                "amountOfMoney": {
                    "amount": 2345,
                    "currencyCode": "EUR"
                },
                "references": {
                    "paymentReference": "0"
                },
                "paymentMethod": "card",
                "cardPaymentMethodSpecificOutput": {
                    "paymentProductId": 1
                }
            },
            "status": "REJECTED",
            "statusOutput": {
                "errors": [
                    {
                        "code": "21000020",
                        "requestId": "2001798",
                        "message": "VALUE **************** OF FIELD CREDITCARDNUMBER DID NOT PASS THE LUHNCHECK"
                    }
                ],
                "isCancellable": false,
                "statusCode": 2,
                "statusCodeChangeDateTime": "20200101123030",
                "isAuthorized": false
            }
        }
    }
}
